score-powershell/src/main/resources/templates/Receive.xml

<s:Envelope
        xmlns:s="http://www.w3.org/2003/05/soap-envelope"
        xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
        xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd"
        xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell">
    <s:Header>
        <wsa:To>$PLACEHOLDER_FOR_SERVICE_NETWORK_ADDRESS</wsa:To>
        <wsa:Action s:mustUnderstand="true">
            http://schemas.microsoft.com/wbem/wsman/1/windows/shell/Receive
        </wsa:Action>
        <wsa:MessageID>$PLACEHOLDER_FOR_MESSAGE_ID</wsa:MessageID>
        <wsman:ResourceURI s:mustUnderstand="true">
            http://schemas.microsoft.com/wbem/wsman/1/windows/shell/cmd
        </wsman:ResourceURI>
        <wsa:ReplyTo>
            <wsa:Address s:mustUnderstand="true">
                http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous
            </wsa:Address>
        </wsa:ReplyTo>
        <wsman:MaxEnvelopeSize s:mustUnderstand="true">$PLACEHOLDER_FOR_MAX_ENVELOPE_SIZE</wsman:MaxEnvelopeSize>
        <wsman:Locale xml:lang="$PLACEHOLDER_FOR_LOCALE" s:mustUnderstand="false"/>
        <wsman:SelectorSet>
            <wsman:Selector Name="ShellId">
                $PLACEHOLDER_FOR_SHELL_ID
            </wsman:Selector>
        </wsman:SelectorSet>
        <wsman:OptionSet>
            <wsman:Option Name="WSMAN_CMDSHELL_OPTION_KEEPALIVE">TRUE</wsman:Option>
        </wsman:OptionSet>
        <wsman:OperationTimeout>PT$PLACEHOLDER_FOR_OPERATION_TIMEOUT.000S</wsman:OperationTimeout>
    </s:Header>
    <s:Body>
        <rsp:Receive>
            <rsp:DesiredStream CommandId="$PLACEHOLDER_FOR_COMMAND_ID">
                stdout
            </rsp:DesiredStream>
        </rsp:Receive>
    </s:Body>
</s:Envelope>